app/controllers/listings_controller.rb

INSERT INTO "listings" ("title", "description", "price", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @listing = Listing.new(listing_params)
    @listing.user_id = current_user.id

    respond_to do |format|
      if @listing.save

UPDATE "listings" SET "price" = $1, "updated_at" = $2 WHERE "listings"."id" = $3  [["price", "2.0"], ["updated_at", "2015-05-13 20:32:41.701555"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @listing.update(listing_params)